OdGsDCRect.m_max
Maximum point.

OdGsDCRect.m_min
Minimum point.

OdGsDCRect.isDisjoint(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified rectangle object does not intersect this rectangle.
\param r [in]  Rectangle to check.
\returns
true if the specified rectangle object does not intersect
this rectangle, false otherwise.

OdGsDCRect.normalize
\details
Normalizes this rectangle by setting valid values to minimum and maximum points.

OdGsDCRect.intersectWith(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Makes a new rectangle as a result of intersection between this rectangle and the passed rectangle.
\param dcRect     [in]  Rectangle to intersect with.
\param bValidate  [in]  Validates the new rectangle. If set to true, the new rectangle is guarantied to be valid or null.

OdGsDCRect.offset(System.Int32!System.Runtime.CompilerServices.IsLong,System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Moves this rectangle in the provided direction.
\param x [in]  Number of pixels to move by x-axis. Negative value moves rectangle in the opposite direction of the positive x-axis.
\param y [in]  Number of pixels to move by y-axis. Negative value moves rectangle in the opposite direction of the positive y-axis.

OdGsDCRect.within(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether this rectangle object is inside the specified rectangle object.
\param dcRect [in]  Any display coordinate rectangle.
\returns
true if this rectangle object is inside the specified rectangle object.
\remarks
A coincident edge is considered inside.

OdGsDCRect.is_null
\details
Checks whether this rectangle object is the null rectangle.
\returns
true if this rectangle object is the null rectangle, false otherwise.

OdGsDCRect.set_null
\details
Sets this rectangle object to the null rectangle.

OdGsDCRect.op_Inequality(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Inequality operator for the OdGsDCRect class.
Rectangles are considered not equal if at least one of the following conditions fails:
* the minimum point of this rectangle equals to the minimum point of the passed rectangle
* the maximum point of this rectangle equals to the maximum point of the passed rectangle
\param dcRect [in]  2D rectangle to compare.

OdGsDCRect.op_Equality(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Equality operator for the OdGsDCRect class.
Rectangles are considered equal if:
* the minimum point of this rectangle equals to the minimum point of the passed rectangle
* the maximum point of this rectangle equals to the maximum point of the passed rectangle
\param dcPoint [in]  2D rectangle to compare.

OdGsDCRect.op_BitwiseAndAssignment(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment by bitwise AND operator for the OdGsDCRect class.
The greater values for coordinates are assigned to the minimum point while the minor values are assigned to the maximum point.
New rectangle is result of intersection between this rectangle and the passed rectangle.
\param dcRect [in]  Rectangle, points of which are assigned, if necessary.

OdGsDCRect.op_BitwiseOrAssignment(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the OdGsDCRect class. Assigns the passed rectangle.
\param dcRect [in]  Minimum X-coordinate.
\details
Assignment by bitwise OR operator for the OdGsDCRect class.
The minor values for coordinates are assigned to the minimum point while the greater values are assigned to the maximum point.
As result, rectangle is extended.
\param dcRect [in]  Rectangle, points of which are assigned, if necessary.

OdGsDCRect.#ctor(OdGsDCRect.NullFlag)
\details
Constructor for the OdGsDCRect class. Creates a null rectangle.

OdGsDCRect.#ctor(System.Int32!System.Runtime.CompilerServices.IsLong,System.Int32!System.Runtime.CompilerServices.IsLong,System.Int32!System.Runtime.CompilerServices.IsLong,System.Int32!System.Runtime.CompilerServices.IsLong)
\details
Constructor for the OdGsDCRect class.
\param xMin [in]  Minimum X-coordinate.
\param xMax [in]  Maximum X-coordinate.
\param yMin [in]  Minimum Y-coordinate.
\param yMax [in]  Maximum Y-coordinate.

OdGsDCRect.#ctor(OdGsDCPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDCPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGsDCRect class.
\param minPoint [in]  Lower-left corner.
\param maxPoint [in]  Upper-right corner.

OdGsDCRect.#ctor
\details
Default constructor for the OdGsDCRect class.